## [DataFrame 인덱스 다루기]

- (1) 새로운 인덱스 설정 : 컬럼 ==> 인덱스 설정

- (1) 모듈 로딩<hr>

In [22]:
import pandas as pd

- (2) 데이터 준비<hr>

In [23]:
# dict 타입의 데이터 생성
exam={'이름':['김','이','박','조'],
       '국어': [90,60,40,39],
       '수학': [80,30,40,20],
       '사회': [30,35,49,97],
       '과학': [47,60,30,65]
     }

- (3) 데이터 저장

In [24]:
examDF=pd.DataFrame(exam)

- (4) 데이터 확인

In [25]:
examDF

  이름  국어  수학  사회  과학
0  김  90  80  30  47
1  이  60  30  35  60
2  박  40  40  49  30
3  조  39  20  97  65

- (5) 새로운 인덱스 설정 : 컬럼 ==> 인덱스 일부 변경 DF.rename()

In [26]:
# 행 인덱스 일부 변경 => {기존인덱스:새로운인덱스}
# inplace 매개변수/파라미터 => 원본 DataFrame에 변경 여부 결정, 기본은 원본 변경 안함 False!!
examDF.rename(index={0:'zero'}, inplace=True)

In [27]:
examDF

     이름  국어  수학  사회  과학
zero  김  90  80  30  47
1     이  60  30  35  60
2     박  40  40  49  30
3     조  39  20  97  65

In [29]:
# 열 이름 인덱스 일부 변경 => column={기존인덱스:새로운인덱스}
examDF.rename(columns={'과학':'영어'}, inplace=True)

In [31]:
examDF.columns

Index(['이름', '국어', '수학', '사회', '영어'], dtype='object')

- (5) 새로운 인덱스 설정 - 방법2: 특정 컬럼 => 인덱스 : DF.set_index()

In [32]:
# 현재 기본 0 ~ ==> 이름 컬럼 인덱스로 설정
examDF.index

Index(['zero', 1, 2, 3], dtype='object')

In [42]:
# 1개 컬럼을 인덱스로 설정 단, inplace 파라미터가 False로 원본 적용 안됨!
examDF2=examDF.set_index('이름')
examDF2.index

Index(['김', '이', '박', '조'], dtype='object', name='이름')

In [46]:
examDF2.loc['김']

국어    90
수학    80
사회    30
영어    47
Name: 김, dtype: int64

In [45]:
# 2개의 컬럼을 행 인덱스 설정 단, inplace 파라미터가 False로 원본에 적용 안됨!
examDF3=examDF.set_index(['이름', '국어', '수학'])
examDF3.index

MultiIndex([('김', 90, 80),
            ('이', 60, 30),
            ('박', 40, 40),
            ('조', 39, 20)],
           names=['이름', '국어', '수학'])

In [49]:
examDF3

          사회  영어
이름 국어 수학
김  90 80  30  47
이  60 30  35  60
박  40 40  49  30
조  39 20  97  65

In [48]:
examDF3.loc[('김', 90, 80)]

사회    30
영어    47
Name: (김, 90, 80), dtype: int64

In [50]:
examDF3.loc[('김')]

       사회  영어
국어 수학
90 80  30  47

In [51]:
examDF3.loc[('김', 90)]

C:\Users\KDP-30\AppData\Local\Temp\ipykernel_15364\753133733.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  examDF3.loc[('김', 90)]

    사회  영어
수학
80  30  47

In [53]:
# KeyError => '김',90,80 형식으로 90으로 시작하는 키 없음(중간부터 시작 못함)
#examDF3.loc[(90, 80)]

- (5) 새로운 인덱스 설정 - 방법3:

In [54]:
examDF.set_index('이름', inplace=True)

In [55]:
examDF

    국어  수학  사회  영어
이름
김   90  80  30  47
이   60  30  35  60
박   40  40  49  30
조   39  20  97  65

In [56]:
# 현재 행 인덱스 ==> 컬럼으로 추가
examDF.reset_index()

  이름  국어  수학  사회  영어
0  김  90  80  30  47
1  이  60  30  35  60
2  박  40  40  49  30
3  조  39  20  97  65

In [57]:
examDF

    국어  수학  사회  영어
이름
김   90  80  30  47
이   60  30  35  60
박   40  40  49  30
조   39  20  97  65

In [59]:
# 현재 행 인덱스를 컬럼에 추가 하지 않고 삭제 => drop 파라미터를 True로 설정
df2=examDF.reset_index(drop=True)
df2

   국어  수학  사회  영어
0  90  80  30  47
1  60  30  35  60
2  40  40  49  30
3  39  20  97  65